In [15]:
import pandas as pd

import sqlite3
%load_ext sql
%sql sqlite:///testdb.sqlite

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

#### Create pandas dataframe

In [16]:
df = pd.DataFrame(
    [[1, 2, 3], [4, 5, 6], [7, 8, 9]],
    columns=['a', 'b', 'c']
)
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

#### Create db connection

In [17]:
conn = sqlite3.connect('testdb.sqlite')

#### Insert data into the SQL table

In [18]:
df.to_sql('df_table', conn, if_exists='replace', index=False)

#### Query SQL table

In [22]:
%%sql
SELECT * FROM df_table;

 * sqlite:///testdb.sqlite
Done.

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [27]:
#### Retrieve data from SQL back into pandas dataframe

In [23]:
cursor = conn.cursor()

cursor.execute("SELECT * FROM df_table LIMIT 10")

for row in cursor.fetchall():
    print (row)

(1, 2, 3)
(4, 5, 6)
(7, 8, 9)

In [26]:
retrieved_df = pd.read_sql("SELECT * FROM df_table LIMIT 10", conn)
retrieved_df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9